src/Catalogs/AdditionalDataAndAttributesSettings.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>AdditionalDataAndAttributesSettings</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>AdditionalAttributes</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalDataAndAttributes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>AdditionalData</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Property</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.AdditionalDataAndAttributes</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/AdditionalDataAndAttributesSettings/Forms/GroupForm/Ext/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancellation, StandardProcessing)
	
	Var FirstPartOfName, SecondPartOfName;
	
	ReadOnly = True;
	
	Catalogs.AdditionalDataAndAttributesSettings.GetNameParts(Object.Ref, FirstPartOfName, SecondPartOfName);
	
	If NOT Catalogs.AdditionalDataAndAttributesSettings.UsedAdditionalAttributes(FirstPartOfName, SecondPartOfName) Then
		Items.AdditionalAttributes.Visible = False;
	EndIf;
	
	If NOT Catalogs.AdditionalDataAndAttributesSettings.UsedAdditionalData(FirstPartOfName, SecondPartOfName) Then
		Items.AdditionalData.Visible = False;
	EndIf;
	
EndProcedure
